tap "coder/coder"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "rfidresearchgroup/proxmark3"
tap "sachaos/todoist"
tap "stripe/stripe-cli"
tap "temporalio/brew"
tap "typesense/tap"
tap "waydabber/betterdisplay"
tap "xo/xo"
tap "yakitrak/yakitrak"
# Run your GitHub Actions locally
brew "act"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# AI pair programming in your terminal
brew "aider"
# Slice and dice log files on the command-line
brew "angle-grinder"
# Download with resuming and segmented downloading
brew "aria2"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Fully functional local AWS cloud stack
brew "localstack"
# Thin wrapper around the `aws` command-line interface for use with LocalStack
brew "awscli-local"
# Language Server for Bash
brew "bash-language-server"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Python code formatter
brew "black"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Control Google Chrome from the command-line
brew "chrome-cli"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler2"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Power of curl, ease of use of httpie
brew "curlie"
# Unit Testing Framework for C and C++
brew "cutter"
# Internet file retriever
brew "wget"
# Search API docs offline, in your terminal or browser
brew "dasht"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Extremely fast JavaScript bundler and minifier
brew "esbuild"
# AST-based pattern checker for JavaScript
brew "eslint"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Google Drive CLI Client
brew "gdrive"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Alternative to top/htop
brew "glances"
# Render markdown on the CLI
brew "glow"
# Language server for the Go language
brew "gopls"
# Ping, but with a graph
brew "gping"
# Command-line tool for generating regular expressions
brew "grex"
# Make JSON greppable
brew "gron"
# Post-modern modal text editor
brew "helix"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Interactive command-line HTTP client with autocomplete and syntax highlighting
brew "http-prompt"
# Website copier/offline browser
brew "httrack"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# JSON diff and patch
brew "jd"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# Simple terminal UI for git commands
brew "lazygit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server Protocol for Markdown
brew "marksman"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# High Performance, Kubernetes Native Object Storage
brew "minio"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# CLI for NextDNS's DNS-over-HTTPS (DoH)
brew "nextdns"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Command-line Git information tool
brew "onefetch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern API client that lives in your terminal
brew "posting"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Service monitoring system and time series database
brew "prometheus"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Next-generation ES module bundler
brew "rollup"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup"
# Web crawling & scraping framework
brew "scrapy"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Fast, lightweight & schema-less search backend
brew "sonic"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Speex audio processing library
brew "speexdsp"
# Data wrangler with jq-like query language
brew "sq"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Simplified and community-driven man pages
brew "tldr"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Terminal multiplexer
brew "tmux"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Next generation frontend tooling. It's fast!
brew "vite"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Convert HTML to PDF
brew "weasyprint"
# Access X11 clipboards from the command-line
brew "xclip"
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Language Server for Yaml Files
brew "yaml-language-server"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Auto-close and delete matching delimiters in zsh
brew "zsh-autopair"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Auto-expanding abbreviations manager for zsh, inspired by fish
brew "olets/tap/zsh-abbr"
# Zsh plugin to add zsh-abbr's abbreviations to zsh-autosuggestions' suggestions
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
# RRG/Iceman Proxmark3 client, CDC flasher and firmware bundle
brew "rfidresearchgroup/proxmark3/proxmark3"
# Todoist CLI client
brew "sachaos/todoist/todoist"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Temporal Cloud CLI (tcld)
brew "temporalio/brew/tcld"
brew "yakitrak/yakitrak/obsidian-cli"
# Renamer for files, music and photos
cask "a-better-finder-rename"
# Note editor and whiteboard
cask "affine"
# Open-source AI-native IDE
cask "aide-app"
# Memory training application
cask "anki"
# API development platform
cask "apidog"
# Chromium based browser
cask "arc"
# Manage team projects and tasks
cask "asana"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# Display management tool
cask "betterdisplay"
# Virtual Audio Driver
cask "blackhole-16ch"
# AI chat client
cask "boltai"
# Web browser focusing on privacy
cask "brave-browser"
# Automation tool
cask "bunch"
# Design tool
cask "canva"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Contacts manager
cask "cardhop"
# App launcher and switcher
cask "charmstone"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Track and budget money
cask "copilot"
# GUI companion app for Homebrew
cask "cork"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Audio and video editor
cask "descript"
# Collect, organise, edit and annotate documents
cask "devonthink"
# All-in-one toolbox for developers
cask "devutils"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Information browser
cask "follow"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Desktop automation application
cask "hammerspoon"
# Automated organisation
cask "hazel"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Reverse engineering tool that lets you disassemble, decompile and debug your app
cask "hopper-disassembler"
# Open source API development ecosystem
cask "hoppscotch"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Icon organiser
cask "iconjar"
# System monitoring app
cask "istat-menus"
# Menu bar calendar
cask "itsycal"
# Remote desktop app
cask "jump-desktop-connect"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Open-source keystroke visualiser
cask "keycastr"
# ZSA keyboard firmware flasher
cask "keymapp"
# Discover, download, and run local LLMs
cask "lm-studio"
# Speech recognition tool
cask "macwhisper"
# Online collaborative whiteboard platform
cask "miro"
# Open-source download manager
cask "motrix"
# Developer IDE or Management Environment for Neo4j instances
cask "neo4j"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Replacement for Docker Desktop
cask "orbstack"
# SQL powered operating system instrumentation and analytics
cask "osquery"
# Command palette in any application
cask "paletro"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# PDF reader, editor and annotator
cask "pdf-expert"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Quickly quit one, some, or all apps
cask "quit-all"
# Control your tools with a few keystrokes
cask "raycast"
# AI time tracker
cask "rize"
# Remote management solution
cask "royal-tsx"
# Monitors the computer system and optimises its performance
cask "sensei"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Notepad with a built-in calculator
cask "soulver"
# Sound and audio controller
cask "soundsource"
# Music streaming service
cask "spotify"
# Email client
cask "superhuman"
# Control windows and applications right from your trackpad
cask "swish"
# Tool to manage Synology NAS's across a LAN
cask "synologyassistant"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale"
# SSH client
cask "termius"
cask "timelane"
# To-do list
cask "todoist"
# Git client focusing on power and productivity
cask "tower"
# Configurable document editor that supports Markdown
cask "typora"
# Virtualization tool
cask "virtualbuddy"
# Open-source code editor
cask "visual-studio-code"
# Agentic IDE powered by AI Flow paradigm
cask "windsurf"
# Network protocol analyzer
cask "wireshark"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
mas "Aiko", id: 1672085276
mas "Alpenglow", id: 978589174
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Cleaner One Pro", id: 1133028347
mas "CleanMyMac", id: 1339170533
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "ExcalidrawZ", id: 6636493997
mas "Flighty", id: 1358823008
mas "Flow", id: 1423210932
mas "Focus", id: 777233759
mas "HacKit", id: 1549557075
mas "Journey", id: 1662059644
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
mas "Logic Pro", id: 634148309
mas "Mela", id: 1568924476
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Omnivore", id: 1564031042
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Parcel", id: 639968404
mas "Paste", id: 967805235
mas "Pixea", id: 1507782672
mas "rcmd", id: 1596283165
mas "Session", id: 1521432881
mas "SnippetsLab", id: 1006087419
mas "Snippety", id: 1530751461
mas "Snippit", id: 1465481124
mas "Structured", id: 1499198946
mas "Termius", id: 1176074088
mas "Todoist", id: 585829637
mas "Toggl Track", id: 1291898086
mas "Tripsy", id: 1429967544
mas "Yoink", id: 457622435
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "actboy168.lua-debug"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alefragnani.rtf"
vscode "amazonemr.emr-tools"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "antfu.vite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arianjamasb.protein-viewer"
vscode "arrterian.nix-env-selector"
vscode "asvetliakov.vscode-neovim"
vscode "atishay-jain.all-autocomplete"
vscode "atlassian.atlascode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bodil.file-browser"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "burkeholland.simple-react-snippets"
vscode "bysabi.prettier-vscode-standard"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "cstrap.flask-snippets"
vscode "cstrap.python-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "equimper.react-native-react-redux"
vscode "ericsia.pythonsnippets3"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-theme"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "honnamkuan.golang-snippets"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idered.npm"
vscode "infeng.vscode-react-typescript"
vscode "infracost.infracost"
vscode "jacano.vscode-pnpm"
vscode "jacobdufault.fuzzy-search"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jebbs.plantuml"
vscode "jithurjacob.nbpreviewer"
vscode "jnoortheen.nix-ide"
vscode "kahole.magit"
vscode "kamadorueda.alejandra"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lastmile-ai.vscode-aiconfig"
vscode "launchdarklyofficial.launchdarkly"
vscode "leetcode.vscode-leetcode"
vscode "leodevbro.blockman"
vscode "magicstack.magicpython"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgesbert.python-path"
vscode "mgmcdermott.vscode-language-babel"
vscode "mintlify.document"
vscode "mkhl.direnv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "nefrob.vscode-just-syntax"
vscode "negokaz.live-server-preview"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "patbenatar.advanced-new-file"
vscode "pflannery.vscode-versionlens"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-product-icons"
vscode "planbcoding.vscode-react-refactor"
vscode "pmneo.tsimporter"
vscode "pomdtr.excalidraw-editor"
vscode "postman.postman-for-vscode"
vscode "prateekmahendrakar.prettyxml"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "qassimfarid.ejs-language-support"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "redocly.openapi-vs-code"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rubbersheep.gi"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.partial-diff"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "semanticdiff.semanticdiff"
vscode "shinotatwu-ds.file-tree-generator"
vscode "sidneys1.gitconfig"
vscode "sidthesloth.html5-boilerplate"
vscode "siris01.catppuccin-theme"
vscode "skellock.just"
vscode "skyran.js-jsx-snippets"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.vscode-multiclip"
vscode "sourcery.sourcery"
vscode "standard.vscode-standard"
vscode "statelyai.stately-vscode"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "supabase.vscode-supabase-extension"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "teamhub.teamhub"
vscode "techer.open-in-browser"
vscode "terrastruct.d2"
vscode "tim-koehler.helm-intellisense"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "tonka3000.raycast"
vscode "trunk.io"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "virgilsisoe.hammerspoon"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gitdoc"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zenstack.zenstack"
vscode "zhouronghui.propertylist"
vscode "zhuangtongfa.material-theme"
