# Taps (Third-Party Repositories)
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "spider-rs/spider-cloud-cli"
tap "f1bonacc1/tap"
tap "nikitabobko/tap"

# Formulae (Development & Utility CLIs)
# Rust toolchain manager (Requires post-install script execution)
brew "atuin"           # Shell history sync
brew "starship"        # Customizable prompt
brew "zoxide"          # Smart directory navigation
brew "direnv"          # Per-directory environment variables
brew "just"            # Command runner
brew "uv"              # Python package installer/resolver
brew "bat"             # Better cat
brew "eza"             # Better ls
brew "fd"              # Better find
brew "ripgrep"         # Better grep
brew "sd"              # Better sed
brew "dust"            # Disk usage statistics
brew "procs"           # Better ps
brew "htop"            # Process viewer
brew "git"             # Version control
brew "git-delta"       # Better git diffs
brew "gh"              # GitHub CLI
brew "lazygit"         # Git TUI
brew "glow"            # Markdown viewer

# HTTP/REST Tools
brew "curl"            # HTTP client
brew "xh"              # Modern HTTP client (HTTPie alternative)
brew "hurl"            # HTTP request testing
brew "caddy"           # HTTP server with automatic HTTPS
brew "bruno-cli"       # Git-friendly API client

# JSON Tools
brew "jq"              # JSON processor
brew "fx"              # JSON viewer
brew "jtbl"            # JSON to tables
brew "jo"              # JSON generator from shell

# OpenAPI Tools
brew "prism-cli"       # API mocking and contract testing
brew "kiota"           # HTTP client generator from OpenAPI
brew "spectral-cli"    # OpenAPI linter
brew "openapi-tui"     # Terminal UI for OpenAPI

# Logs and Monitoring
brew "lnav"            # Log file navigator
brew "glances"         # System monitoring
brew "goaccess"        # Web log analyzer

# Docker/Containerization
brew "lazydocker"      # Docker TUI
brew "f1bonacc1/tap/process-compose"  # Process orchestration
brew "nixpacks"        # Container builder
brew "dive"            # Docker layer explorer
brew "podman"          # Alternative container runtime

# Security Tools
brew "gitleaks"        # Secret scanner
brew "semgrep"         # Static analysis
brew "trufflehog"      # Credential finder
brew "trivy"           # Vulnerability scanner
brew "sops"            # Secrets management

# Development Environment
brew "neovim"          # Text editor
brew "zellij"          # Terminal multiplexer
brew "mise"            # Runtime version manager
brew "entr"            # File watcher
brew "lefthook"        # Git hooks manager
brew "biome"           # JavaScript formatter/linter

# Database Tools
brew "postgresql@17"   # PostgreSQL database
brew "datasette"       # SQLite explorer
brew "pgcli"           # PostgreSQL CLI

# AWS Tools
brew "awscli"          # AWS CLI
brew "localstack"      # Local AWS emulator

# Programming Languages
brew "go"              # Go language
brew "bun"             # JavaScript runtime
brew "rustup-init"     # Rust toolchain installer

# Shell Enhancements
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Media and Data Processing
brew "imagemagick"     # Image manipulation
brew "pandoc"          # Document converter
brew "tesseract"       # OCR engine
brew "tesseract-lang"  # OCR language data
brew "miller"          # CSV processor

# Network Tools
brew "wireshark"       # Network analyzer
brew "rustscan"        # Fast port scanner
brew "speedtest-cli"   # Internet speed test

# Misc Utilities
brew "yazi"            # Terminal file manager
brew "fastfetch"       # System information
brew "wiremock-standalone" # API mocking server
brew "spider-cloud-cli" # Web scraping
brew "aider"           # AI coding assistant
brew "mas"             # Mac App Store CLI

# HTTP 
brew "curl"




# Etc

brew "atuin", restart_service: :changed
brew "awscli"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "coder"
brew "datasette"
brew "direnv"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "just"
brew "kanata"
brew "koekeishiya/formulae/skhd"
brew "lazygit"
brew "lnav"
brew "localstack"
brew "mas"
brew "miller"
brew "neovim"
brew "nvm"
brew "oven-sh/bun/bun"
brew "postgresql@17", restart_service: :changed
brew "posting"
brew "procs"
brew "ripgrep"
brew "rustscan"
brew "rustup-init"     
brew "sd"
brew "sops"
brew "speedtest-cli"
brew "spider-cloud-cli"
brew "starship"
brew "tesseract"
brew "tesseract-lang"
brew "tlrc"
brew "uv"
brew "volta"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "aider"
brew "caddy"
brew "f1bonacc1/tap/process-compose"
brew "fastfetch"
brew "gitleaks"
brew "glances"
brew "httpie"
brew "lazydocker"
brew "nixpacks"
brew "pandoc"
brew "prism-cli"
brew "rustscan"
brew "semgrep"
brew "siderolabs/tap/talosctl"
brew "spectral-cli"
brew "trufflehog"
brew "vite"
brew "volta"
brew "wiremock-standalone"
brew "wireshark"

# Casks (GUI Applications & Fonts)
# cask "warp"              # Already in core
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "bartender"
cask "betterdisplay"
cask "bitwarden"
cask "block-goose"
cask "bruno"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "codeql"
cask "coq-platform"
cask "cursor"
cask "dadroit-json-viewer"
cask "dash"
cask "descript"
cask "devutils"
cask "excalidrawz"
cask "fantastical"
cask "figma"
cask "folo"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "fork"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "hazel"
cask "homerow"
cask "httpie"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "jump"
cask "jump-desktop-connect"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "linear-linear"
cask "lm-studio"
cask "maccy"
cask "macwhisper"
cask "mitmproxy"
cask "ngrok"
cask "nikitabobko/tap/aerospace"
cask "nosql-workbench"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "pdf-expert"
cask "postman"
cask "prism"
cask "prisma-studio"
cask "proxyman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quit-all"
cask "raycast"
cask "repo-prompt"
cask "slack"
cask "spotify"
cask "superhuman"
cask "swish"
cask "syntax-highlight"
cask "tableplus"
cask "tailscale"
cask "timelane"
cask "tla+-toolbox"
cask "todoist"
cask "tower"
cask "virtualbuddy"
cask "visual-paradigm"
cask "visual-studio-code"
ask "warp"
cask "windsurf"
cask "wireshark"
cask "zen-browser"


# Mac App Store Applications (Managed via `mas`)
# Ensure `mas` CLI is installed from Formulae section above or core
mas "Drafts", id: 1435957248
mas "Essentials", id: 1588151344
mas "Hidden Bar", id: 1452453066
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Raycast Companion", id: 6738274497
mas "Screens 5", id: 1663047912

