tap "coder/coder"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "rfidresearchgroup/proxmark3"
tap "stripe/stripe-cli"
tap "temporalio/brew"
tap "typesense/tap"
tap "waydabber/betterdisplay"
tap "xo/xo"
brew "act"
brew "shellcheck"
brew "actionlint"
brew "aider"
brew "angle-grinder"
brew "ast-grep"
brew "atuin", restart_service: :changed
brew "localstack"
brew "awscli-local"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "bottom"
brew "broot"
brew "cheat"
brew "chrome-cli"
brew "cloudflare-wrangler2"
brew "curl"
brew "curlie"
brew "cutter"
brew "wget"
brew "dasht"
brew "datasette"
brew "direnv"
brew "duf"
brew "dust"
brew "esbuild"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "gdrive"
brew "gh"
brew "ghi"
brew "git-delta"
brew "glances"
brew "glow"
brew "gping"
brew "grex"
brew "gron"
brew "helix"
brew "hexyl"
brew "htop"
brew "http-prompt"
brew "httrack"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jd"
brew "jq"
brew "just"
brew "k9s"
brew "kanata"
brew "lazygit"
brew "lnav"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "miller"
brew "minio"
brew "nasm"
brew "neovim"
brew "netcat"
brew "nextdns"
brew "nmap"
brew "nnn"
brew "odin"
brew "onefetch"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "posting"
brew "prettier"
brew "procs"
brew "prometheus"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "rollup"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "rustscan"
brew "rustup"
brew "scrapy"
brew "sd"
brew "sevenzip"
brew "skaffold"
brew "sonic"
brew "speedtest-cli"
brew "speexdsp"
brew "sq"
brew "temporal"
brew "tldr"
brew "traefik"
brew "tree"
brew "trippy"
brew "uv"
brew "vite"
brew "volta"
brew "weasyprint"
brew "xclip"
brew "xh"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "olets/tap/zsh-abbr"
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
brew "stripe/stripe-cli/stripe"
brew "temporalio/brew/tcld"
cask "a-better-finder-rename"
cask "aide-app"
cask "arc"
cask "apidog"
cask "arq"
cask "bartender"
cask "betterdisplay"
cask "boltai"
cask "carbon-copy-cloner"
cask "canva"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "copilot"
cask "cork"
cask "cursor"
cask "dash"
cask "devutils"
cask "fantastical"
cask "figma"
cask "follow"
cask "font-symbols-only-nerd-font"
cask "ghidra"
cask "ghostty"
cask "gitkraken"
cask "google-drive"
cask "hammerspoon"
cask "homerow"
cask "hopper-disassembler"
cask "hoppscotch"
cask "httpie"
cask "istat-menus"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keycastr"
cask "keymapp"
cask "lm-studio"
cask "miro"
cask "motrix"
cask "mullvadvpn"
cask "neo4j"
cask "obsidian"
cask "ollama"
cask "orbstack"
cask "royal-tsx"
cask "parsec"
cask "pdf-expert"
cask "proton-mail"
cask "proxyman"
cask "qflipper"
cask "raycast"
cask "rize"
cask "sensei"
cask "signal"
cask "slack"
cask "soulver"
cask "soundsource"
cask "spotify"
cask "superhuman"
cask "swish"
cask "synologyassistant"
cask "tableplus"
cask "tailscale"
cask "termius"
cask "timelane"
cask "tower"
cask "virtualbuddy"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zed"
cask "zen-browser"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Canva", id: 897446215
mas "Cleaner One Pro", id: 1133028347
mas "CleanMyMac", id: 1339170533
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "ExcalidrawZ", id: 6636493997
mas "Fantastical", id: 975937182
mas "Flow", id: 1423210932
mas "Focus", id: 777233759
mas "Jump Desktop", id: 524141863
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
mas "lire", id: 1482527526
mas "Numbers", id: 409203825
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Pixea", id: 1507782672
mas "Termius", id: 1176074088
mas "Todoist", id: 585829637
mas "Toggl Track", id: 1291898086
mas "Tripsy", id: 1429967544
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "antfu.file-nesting"
vscode "antfu.icons-carbon"
vscode "antfu.vite"

vscode "arianjamasb.protein-viewer"
vscode "arrterian.nix-env-selector"
vscode "aykutsarac.jsoncrack-vscode"
vscode "batisteo.vscode-django"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "bysabi.prettier-vscode-standard"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "cstrap.python-snippets"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ibm.output-colorizer"
vscode "jnoortheen.nix-ide"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lastmile-ai.vscode-aiconfig"
vscode "launchdarklyofficial.launchdarkly"
vscode "leodevbro.blockman"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mgesbert.python-path"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "nefrob.vscode-just-syntax"
vscode "patbenatar.advanced-new-file"
vscode "pmneo.tsimporter"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "rooveterinaryinc.roo-cline"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "saoudrizwan.claude-dev"
vscode "sdras.night-owl"
vscode "shinotatwu-ds.file-tree-generator"
vscode "semanticdiff.semanticdiff"
vscode "sidthesloth.html5-boilerplate"
vscode "siris01.catppuccin-theme"
vscode "skellock.just"
vscode "statelyai.stately-vscode"
vscode "stringham.move-ts"
vscode "supabase.vscode-supabase-extension"
vscode "sleistner.vscode-fileutils"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "tonka3000.raycast"
vscode "sumneko.lua"
vscode "trunk.io"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "virgilsisoe.hammerspoon"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zenstack.zenstack"
