tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kdash-rs/kdash"
tap "lusingander/tap"
tap "oven-sh/bun"
tap "supabase/tap"
tap "ynqa/tap"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Record and share terminal sessions
brew "asciinema"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# New way to see and navigate directory trees
brew "broot"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Music player with an ncurses based interface
brew "cmus"
# Top-like interface for container metrics
brew "ctop"
# Open source multi-tool for exploring and publishing data
brew "datasette"
# DuckDuckGo from the terminal
brew "ddgr"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Alternative to top/htop
brew "glances"
# Ping, but with a graph
brew "gping"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# CLI calendar application
brew "khal"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Powerful paging program
brew "most"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: true
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Modern replacement for ps written by Rust
brew "procs"
# Cloud native development platform
brew "pulumi"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Intuitive find & replace CLI
brew "sd"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Log file highlighter
brew "tailspin"
# User interface to the TELNET protocol
brew "telnet"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Lightweight, POSIX-compliant regular expression (regex) library
brew "tre"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Internet file retriever
brew "wget"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash"
# TUI application for AWS S3 written in Rust using ratatui
brew "lusingander/tap/stu"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# Interactive grep (for streaming)
brew "ynqa/tap/sigrs"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Data backup and storage service
cask "backblaze"
# Alternative GUI for Time Machine
cask "backuploupe"
# Menu bar icon organiser
cask "bartender"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"
# Contacts manager
cask "cardhop"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Track and budget money
cask "copilot"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
# Desktop automation application
cask "hammerspoon"
# System monitoring app
cask "istat-menus"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# PDF reader, editor and annotator
cask "pdf-expert"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Daily planner and calendar
cask "sunsama"
# Email client
cask "superhuman"
# Network toolbox
cask "surge"
# Mesh VPN based on WireGuard
cask "tailscale"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "KakaoTalk", id: 869223134
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alefragnani.rtf"
vscode "amazonemr.emr-tools"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.browse-lite"
vscode "antfu.icons-carbon"
vscode "antfu.vite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arrterian.nix-env-selector"
vscode "arturock.gitstash"
vscode "ashinzekene.nestjs"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "batisteo.vscode-django"
vscode "bbenoist.nix"
vscode "bierner.markdown-preview-github-styles"
vscode "blackboxapp.blackbox"
vscode "bodil.file-browser"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "burkeholland.simple-react-snippets"
vscode "bysabi.prettier-vscode-standard"
vscode "chad.nord-operator-theme"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codecov.codecov"
vscode "codeium.codeium"
vscode "codium.codium"
vscode "continue.continue"
vscode "cstrap.flask-snippets"
vscode "danielsanmedium.dscodegpt"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "davidmikesimon.vscode-argwrap"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "diemasmichiels.emulate"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "doublebot.doublebot"
vscode "dsznajder.es7-react-js-snippets"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "entuent.fira-code-nerd-font"
vscode "equimper.react-native-react-redux"
vscode "equinusocio.vsc-material-theme-icons"
vscode "ericsia.pythonsnippets3"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "file-icons.file-icons"
vscode "fill-labs.dependi"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "george-alisson.html-preview-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "honnamkuan.golang-snippets"
vscode "howardzuo.vscode-favorites"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "idered.npm"
vscode "infeng.vscode-react-typescript"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "infracost.infracost"
vscode "jacano.vscode-pnpm"
vscode "jacobdufault.fuzzy-search"
vscode "jasonnutter.search-node-modules"
vscode "jawandarajbir.react-vscode-extension-pack"
vscode "jebbs.plantuml"
vscode "jithurjacob.nbpreviewer"
vscode "jnoortheen.nix-ide"
vscode "kahole.magit"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "konstantin.wrapselection"
vscode "lastmile-ai.vscode-aiconfig"
vscode "leetcode.vscode-leetcode"
vscode "leodevbro.blockman"
vscode "magicstack.magicpython"
vscode "malmaud.tmux"
vscode "mattflower.aider"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "negokaz.live-server-preview"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "pandy.bun"
vscode "parallelsdesktop.parallels-desktop"
vscode "peakchen90.open-html-in-browser"
vscode "pflannery.vscode-versionlens"
vscode "phind.phind"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pmneo.tsimporter"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "pulkitgangwar.nextjs-snippets"
vscode "qassimfarid.ejs-language-support"
vscode "qcz.text-power-tools"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rlivings39.fzf-quick-open"
vscode "rubbersheep.gi"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.edit-with-shell"
vscode "ryu1kn.partial-diff"
vscode "salesforce.salesforce-vscode-slds"
vscode "salesforce.salesforcedx-vscode"
vscode "salesforce.salesforcedx-vscode-core"
vscode "salesforce.salesforcedx-vscode-lwc"
vscode "salesforce.salesforcedx-vscode-soql"
vscode "salesforce.salesforcedx-vscode-visualforce"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "skellock.just"
vscode "skyran.js-jsx-snippets"
vscode "slevesque.vscode-multiclip"
vscode "sourcery.sourcery"
vscode "sswg.swift-lang"
vscode "statelyai.stately-vscode"
vscode "steoates.autoimport"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "tabnine.tabnine-vscode"
vscode "tailscale.vscode-tailscale"
vscode "tal7aouy.theme"
vscode "talhabalaj.actual-font-changer"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "tomrijndorp.find-it-faster"
vscode "tonka3000.raycast"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "viatsko.html-mason"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vsls-contrib.gitdoc"
vscode "vspacecode.vspacecode"
vscode "vspacecode.whichkey"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zenstack.zenstack"
vscode "zernonia.supabase-vscode"
vscode "zhang-renyang.vscode-react"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
