# Taps (Third-Party Repositories)
tap "koekeishiya/formulae"
tap "oven-sh/bun"
tap "spider-rs/spider-cloud-cli"

# Formulae (Development & Utility CLIs)
# Rust toolchain manager (Requires post-install script execution)
brew "a-better-finder-rename"
brew "atuin", restart_service: :changed
brew "awscli"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "coder"
brew "curl"
brew "datasette"
brew "direnv"
brew "dust"
brew "entr"
brew "eslint"
brew "eza"
brew "fd"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "go"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "just"
brew "kanata"
brew "koekeishiya/formulae/skhd", restart_service: :changed
brew "lazygit"
brew "lnav"
brew "localstack"
brew "mas"
brew "miller"
brew "neovim"
brew "nvm"
brew "oven-sh/bun/bun"
brew "postgresql@17", restart_service: :changed
brew "posting"
brew "procs"
brew "ripgrep"
brew "ruff"
brew "rustscan"
brew "rustup"
brew "rustup-init"     
brew "sd"
brew "sops"
brew "speedtest-cli"
brew "spider-cloud-cli"
brew "starship"
brew "tesseract"
brew "tesseract-lang"
brew "tlrc"
brew "typescript"
brew "typescript-language-server"
brew "uv"
brew "volta"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks (GUI Applications & Fonts)
# cask "warp"              # Already in core
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "apidog"
cask "bartender"
cask "betterdisplay"
cask "bitwarden"
cask "block-goose"
cask "bruno"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "cursor"
cask "dash"
cask "descript"
cask "devutils"
cask "excalidrawz"
cask "fantastical"
cask "figma"
cask "folo"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "fork"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hammerspoon"
cask "hazel"
cask "homerow"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "jump"
cask "jump-desktop-connect"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "linear-linear"
cask "lm-studio"
cask "maccy"
cask "macwhisper"
cask "nosql-workbench"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "pdf-expert"
cask "postman"
cask "proxyman"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "quit-all"
cask "raycast"
cask "slack"
cask "spotify"
cask "superhuman"
cask "swish"
cask "syntax-highlight"
cask "tableplus"
cask "tailscale"
cask "timelane"
cask "todoist"
cask "tower"
cask "virtualbuddy"
cask "visual-paradigm"
cask "visual-studio-code"
cask "warp"
cask "zen-browser"

# Mac App Store Applications (Managed via `mas`)
# Ensure `mas` CLI is installed from Formulae section above or core
mas "Drafts", id: 1435957248
mas "Essentials", id: 1588151344
mas "Hidden Bar", id: 1452453066
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Raycast Companion", id: 6738274497
mas "Screens 5", id: 1663047912

tap "f1bonacc1/tap"
brew "f1bonacc1/tap/process-compose"
brew "httpie"
cask "httpie"
cask "repo-prompt"
brew "gitleaks"
brew "semgrep"
