tap "coder/coder"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "rfidresearchgroup/proxmark3"
tap "sachaos/todoist"
tap "stripe/stripe-cli"
tap "temporalio/brew"
tap "typesense/tap"
tap "waydabber/betterdisplay"
tap "xo/xo"
tap "yakitrak/yakitrak"
brew "act"
brew "shellcheck"
brew "actionlint"
brew "aider"
brew "angle-grinder"
brew "ast-grep"
brew "atuin", restart_service: :changed
brew "localstack"
brew "awscli-local"
brew "bat"
brew "biome"
brew "bitwarden-cli"
brew "bottom"
brew "broot"
brew "cheat"
brew "chrome-cli"
brew "cloudflare-wrangler2"
brew "curl"
brew "curlie"
brew "cutter"
brew "wget"
brew "dasht"
brew "datasette"
brew "direnv"
brew "duf"
brew "dust"
brew "esbuild"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gdrive"
brew "gdrive-downloader"
brew "gh"
brew "ghi"
brew "git"
brew "git-delta"
brew "glances"
brew "glow"
brew "gping"
brew "grex"
brew "gron"
brew "helix"
brew "hexyl"
brew "htop"
brew "http-prompt"
brew "httrack"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jd"
brew "jq"
brew "just"
brew "k9s"
brew "kanata"
brew "lazygit"
brew "lnav"
brew "lsd"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "miller"
brew "minio"
brew "nasm"
brew "neovim"
brew "netcat"
brew "nextdns"
brew "nmap"
brew "nnn"
brew "odin"
brew "onefetch"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "pkgconf"
brew "poppler"
brew "posting"
brew "prettier"
brew "procs"
brew "prometheus"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "rollup"
brew "ruff"
brew "rust"
brew "rust-analyzer"
brew "rustscan"
brew "rustup"
brew "scrapy"
brew "sd"
brew "sevenzip"
brew "skaffold"
brew "sonic"
brew "speedtest-cli"
brew "speexdsp"
brew "sq"
brew "starship"
brew "temporal"
brew "tldr"
brew "traefik"
brew "tree"
brew "trippy"
brew "uv"
brew "vite"
brew "volta"
brew "weasyprint"
brew "xclip"
brew "xh"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "coder/coder/coder"
brew "koekeishiya/formulae/skhd"
brew "olets/tap/zsh-abbr"
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
brew "sachaos/todoist/todoist"
brew "stripe/stripe-cli/stripe"
brew "temporalio/brew/tcld"
brew "yakitrak/yakitrak/obsidian-cli"
cask "a-better-finder-rename"
cask "aide-app"
cask "amazon-chime"
cask "apidog"
cask "arc"
cask "arq"
cask "bartender"
cask "betterdisplay"
cask "boltai"
cask "canva"
cask "carbon-copy-cloner"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "cleanshot"
cask "copilot"
cask "cork"
cask "cursor"
cask "dash"
cask "devutils"
cask "fantastical"
cask "figma"
cask "font-symbols-only-nerd-font"
cask "ghidra"
cask "google-drive"
cask "hazel"
cask "hopper-disassembler"
cask "hoppscotch"
cask "istat-menus"
cask "jump-desktop-connect"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keycastr"
cask "lm-studio"
cask "mullvadvpn"
cask "neo4j"
cask "orbstack"
cask "parallels"
cask "parsec"
cask "proxyman"
cask "rize"
cask "royal-tsx"
cask "setapp"
cask "soulver"
cask "swish"
cask "synologyassistant"
cask "tailscale"
cask "timelane"
cask "tower"
cask "virtualbuddy"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Bitwarden", id: 1352778147
mas "Cleaner One Pro", id: 1133028347
mas "CleanMyMac", id: 1339170533
mas "CloudMounter", id: 1130254674
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "ExcalidrawZ", id: 6636493997
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "Flow", id: 1423210932
mas "Focus", id: 777233759
mas "Journey", id: 1662059644
mas "Jump Desktop", id: 524141863
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LanScan", id: 472226235
mas "lire", id: 1482527526
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Omnivore", id: 1564031042
mas "One Thing", id: 1604176982
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "Pixea", id: 1507782672
mas "Termius", id: 1176074088
mas "Todoist", id: 585829637
mas "Toggl Track", id: 1291898086
mas "Transcribe AI", id: 6479871768
mas "Tripsy", id: 1429967544
mas "Yubico Authenticator", id: 1497506650
vscode "alefragnani.project-manager"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chaitanyashahare.lazygit"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gitpod.gitpod-theme"
vscode "jnoortheen.nix-ide"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "nefrob.vscode-just-syntax"
vscode "patbenatar.advanced-new-file"
vscode "rooveterinaryinc.roo-cline"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "saoudrizwan.claude-dev"
vscode "sleistner.vscode-fileutils"
vscode "sumneko.lua"
vscode "trunk.io"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
