# Cursor IDE Extensions (Installed)
# Generated from: cursor --list-extensions
# To install: cursor --install-extension <extension-id>

# ============================================
# AI / Assistants
# ============================================
anthropic.claude-code
sourcegraph.amp

# ============================================
# Code Formatting & Linting
# ============================================
biomejs.biome
editorconfig.editorconfig

# ============================================
# Git & Version Control
# ============================================
chaitanyashahare.lazygit

# ============================================
# Python
# ============================================
anysphere.cursorpyright
charliermarsh.ruff
ms-python.debugpy
ms-python.python

# ============================================
# JavaScript / TypeScript
# ============================================
dbaeumer.vscode-eslint

# ============================================
# Nix
# ============================================
mkhl.direnv

# ============================================
# DevOps / CI
# ============================================
github.vscode-github-actions
mikestead.dotenv

# ============================================
# Database / ORM
# ============================================
rphlmr.vscode-drizzle-orm

# ============================================
# Editor Navigation
# ============================================
vscodevim.vim
