# Cursor IDE Extensions Reference
# Install manually: cursor --install-extension <extension-id>
# This file is tracked for reference, not auto-deployed

# ============================================
# Essential / Core
# ============================================
vscodevim.vim
editorconfig.editorconfig
vscode-icons-team.vscode-icons
patbenatar.advanced-new-file

# ============================================
# Git & Version Control
# ============================================
eamodio.gitlens
chaitanyashahare.lazygit
github.vscode-pull-request-github

# ============================================
# JavaScript / TypeScript
# ============================================
esbenp.prettier-vscode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
ms-vscode.vscode-typescript-next
yoavbls.pretty-ts-errors
pmneo.tsimporter
stringham.move-ts
biomejs.biome

# ============================================
# Python
# ============================================
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
charliermarsh.ruff

# ============================================
# Go
# ============================================
golang.go

# ============================================
# Nix
# ============================================
bbenoist.nix
jnoortheen.nix-ide
arrterian.nix-env-selector
mkhl.direnv
pinage404.nix-extension-pack

# ============================================
# Lua
# ============================================
sumneko.lua
yinfei.luahelper

# ============================================
# Other Languages
# ============================================
ms-vscode.cpptools
zxh404.vscode-proto3
nixon.env-cmd-file-syntax
skellock.just

# ============================================
# Remote / Docker
# ============================================
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-azuretools.vscode-docker

# ============================================
# Utilities
# ============================================
alefragnani.project-manager
oderwat.indent-rainbow
richie5um2.vscode-sort-json
bierner.markdown-mermaid
george-alisson.html-preview-vscode
ritwickdey.liveserver
jithurjacob.nbpreviewer

# ============================================
# AI / Assistants
# ============================================
lastmile-ai.vscode-aiconfig

# ============================================
# API Testing
# ============================================
postman.postman-for-vscode
